In [1]:
import pandas as pd

In [12]:
df = pd.read_csv('student.csv')
print(df.head(5))

     Name   Age  Marks
0   Aarav  20.0   78.0
1    Sita  19.0   85.0
2  Ramesh  21.0   62.0
3    Gita  20.0   55.0
4    Hari  22.0   90.0

In [28]:
print(df.shape)

(18, 4)

In [ ]:
df.describe()

             Age       Marks
count  19.000000   19.000000
mean   20.421053   69.052632
std     1.121298   22.184764
min    19.000000   15.000000
25%    20.000000   60.500000
50%    20.000000   70.000000
75%    21.000000   83.000000
max    23.000000  110.000000

In [29]:
print(df[df['Marks'] > 60][['Name', 'Marks']])

       Name       Marks
0     Aarav   78.000000
1      Sita   85.000000
2    Ramesh   62.000000
4      Hari   90.000000
6     Pooja   72.000000
7     Kiran   68.000000
8      Maya   68.941176
9     Suman   88.000000
12    Anita   95.000000
13     Rita   81.000000
14   Deepak  110.000000
16  Prakash   65.000000
17   Sunita   70.000000

In [19]:
# Check and handle missing values

df.isnull().sum()

# Filling numeric values with mean
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Marks'].fillna(df['Marks'].mean(), inplace=True)

print(df)

       Name        Age       Marks
0     Aarav  20.000000   78.000000
1      Sita  19.000000   85.000000
2    Ramesh  21.000000   62.000000
3      Gita  20.000000   55.000000
4      Hari  22.000000   90.000000
5     Nabin  21.000000   45.000000
6     Pooja  20.000000   72.000000
7     Kiran  19.000000   68.000000
8      Maya  21.000000   68.941176
9     Suman  20.000000   88.000000
11   Bikash  22.000000   34.000000
12    Anita  19.000000   95.000000
13     Rita  20.411765   81.000000
14   Deepak  21.000000  110.000000
15   Sarita  20.000000   59.000000
16  Prakash  23.000000   65.000000
17   Sunita  19.000000   70.000000
19    Nisha  20.000000   15.000000

In [16]:
# Detect duplicate rows
df[df.duplicated()]

      Name   Age  Marks
10   Aarav  20.0   78.0
18  Ramesh  21.0   62.0

In [18]:
# Remove duplicate rows
df.drop_duplicates(inplace=True)
print(df)

       Name   Age  Marks
0     Aarav  20.0   78.0
1      Sita  19.0   85.0
2    Ramesh  21.0   62.0
3      Gita  20.0   55.0
4      Hari  22.0   90.0
5     Nabin  21.0   45.0
6     Pooja  20.0   72.0
7     Kiran  19.0   68.0
8      Maya  21.0    NaN
9     Suman  20.0   88.0
11   Bikash  22.0   34.0
12    Anita  19.0   95.0
13     Rita   NaN   81.0
14   Deepak  21.0  110.0
15   Sarita  20.0   59.0
16  Prakash  23.0   65.0
17   Sunita  19.0   70.0
19    Nisha  20.0   15.0

In [31]:
Q1 = df['Marks'].quantile(0.25)
Q3 = df['Marks'].quantile(0.75)
IQR = Q3 - Q1

lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR

outliers = df[(df['Marks'] < lower_limit) | (df['Marks'] > upper_limit)]
print(outliers)

# Remove outliers
df = df[(df['Marks'] >= lower_limit) & (df['Marks'] <= upper_limit)]
print("AFTER REMOVING OUTLIERS")
print(df)

Empty DataFrame
Columns: [Name, Age, Marks, new_marks]
Index: []
AFTER REMOVING OUTLIERS
       Name        Age       Marks  new_marks
0     Aarav  20.000000   78.000000   7.800000
1      Sita  19.000000   85.000000   8.500000
2    Ramesh  21.000000   62.000000   6.200000
3      Gita  20.000000   55.000000   5.500000
4      Hari  22.000000   90.000000   9.000000
5     Nabin  21.000000   45.000000   4.500000
6     Pooja  20.000000   72.000000   7.200000
7     Kiran  19.000000   68.000000   6.800000
8      Maya  21.000000   68.941176   6.894118
9     Suman  20.000000   88.000000   8.800000
11   Bikash  22.000000   34.000000   3.400000
12    Anita  19.000000   95.000000   9.500000
13     Rita  20.411765   81.000000   8.100000
14   Deepak  21.000000  110.000000  11.000000
15   Sarita  20.000000   59.000000   5.900000
16  Prakash  23.000000   65.000000   6.500000
17   Sunita  19.000000   70.000000   7.000000

In [32]:
df["new_marks"] = df['Marks'] / 10
print(df)

       Name        Age       Marks  new_marks
0     Aarav  20.000000   78.000000   7.800000
1      Sita  19.000000   85.000000   8.500000
2    Ramesh  21.000000   62.000000   6.200000
3      Gita  20.000000   55.000000   5.500000
4      Hari  22.000000   90.000000   9.000000
5     Nabin  21.000000   45.000000   4.500000
6     Pooja  20.000000   72.000000   7.200000
7     Kiran  19.000000   68.000000   6.800000
8      Maya  21.000000   68.941176   6.894118
9     Suman  20.000000   88.000000   8.800000
11   Bikash  22.000000   34.000000   3.400000
12    Anita  19.000000   95.000000   9.500000
13     Rita  20.411765   81.000000   8.100000
14   Deepak  21.000000  110.000000  11.000000
15   Sarita  20.000000   59.000000   5.900000
16  Prakash  23.000000   65.000000   6.500000
17   Sunita  19.000000   70.000000   7.000000

In [34]:
# Rename Columns
df.rename(columns={
    "Name": "Student_Name",
    "Age": "Student_Age",
    "Marks": "Total_Marks"
}, inplace=True)

print(df)

   Student_Name  Student_Age  Total_Marks  new_marks
0         Aarav    20.000000    78.000000   7.800000
1          Sita    19.000000    85.000000   8.500000
2        Ramesh    21.000000    62.000000   6.200000
3          Gita    20.000000    55.000000   5.500000
4          Hari    22.000000    90.000000   9.000000
5         Nabin    21.000000    45.000000   4.500000
6         Pooja    20.000000    72.000000   7.200000
7         Kiran    19.000000    68.000000   6.800000
8          Maya    21.000000    68.941176   6.894118
9         Suman    20.000000    88.000000   8.800000
11       Bikash    22.000000    34.000000   3.400000
12        Anita    19.000000    95.000000   9.500000
13         Rita    20.411765    81.000000   8.100000
14       Deepak    21.000000   110.000000  11.000000
15       Sarita    20.000000    59.000000   5.900000
16      Prakash    23.000000    65.000000   6.500000
17       Sunita    19.000000    70.000000   7.000000

In [36]:
df.to_csv('student_cleaned.csv', index=False)